In [ ]:
import pandas as pd

# First dataset
df1 = pd.DataFrame({
    "id": [1, 2, 3, 4],
    "name": ["A", "B", "C", "D"]
})

# Second dataset
df2 = pd.DataFrame({
    "id": [3, 4, 5, 6],
    "score": [85, 90, 95, 80]
})

print("DF1:\n", df1)
print("\nDF2:\n", df2)

In [ ]:
#inner join
#in case of sql, the id column should come twice since we are not specifying 
#but in the python the id column is coming once only
df1.merge(df2, on="id", how="inner")

In [ ]:
#left join
df1.merge(df2, on="id", how="left")

In [ ]:
#right join
df1.merge(df2, on="id", how="right")

In [ ]:
#outer join
df1.merge(df2, on="id", how="outer")

In [ ]:
import pandas as pd

df1 = pd.DataFrame({
    "emp_id": [1, 2, 3],
    "name": ["A", "B", "C"]
})

df2 = pd.DataFrame({
    "id": [2, 3, 4],
    "score": [90, 85, 80]
})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.merge(df2, left_on="emp_id", right_on="id", how="inner")

In [ ]:
df1.merge(df2, how="cross")

In [1]:
import pandas as pd

# Employee table
df1 = pd.DataFrame({
    "emp_id": [1, 2, 3],
    "emp_name": ["A", "B", "C"]
})

# Salary table
df2 = pd.DataFrame({
    "id": [1, 2, 4],
    "salary": [5000, 6000, 7000]
})

print("DF1:\n", df1)
print("\nDF2:\n", df2)

DF1:
    emp_id emp_name
0       1        A
1       2        B
2       3        C

DF2:
    id  salary
0   1    5000
1   2    6000
2   4    7000

In [2]:
# set indexes
df1_index = df1.set_index("emp_id")
df2_index = df2.set_index("id")

In [3]:
df1_index

       emp_name
emp_id
1             A
2             B
3             C

In [4]:
df2_index

    salary
id
1     5000
2     6000
4     7000

In [5]:
df1_index.join(df2_index, how ="inner")

  emp_name  salary
1        A    5000
2        B    6000

In [6]:
df1_index.join(df2_index, how ="left")

       emp_name  salary
emp_id
1             A  5000.0
2             B  6000.0
3             C     NaN

In [7]:
df1_index.join(df2_index, how ="right")

   emp_name  salary
id
1         A    5000
2         B    6000
4       NaN    7000

In [8]:
df1_index.join(df2_index, how ="outer")

  emp_name  salary
1        A  5000.0
2        B  6000.0
3        C     NaN
4      NaN  7000.0

In [9]:
df1_index.join(df2_index, how ="cross")

  emp_name  salary
0        A    5000
1        A    6000
2        A    7000
3        B    5000
4        B    6000
5        B    7000
6        C    5000
7        C    6000
8        C    7000